app/controllers/posts_controller.rb

	def index
		@posts = Post.order('created_at desc').all
---
SELECT "posts".* FROM "posts" ORDER BY created_at desc

	def create
		post = Post.create! params[:post]
---
INSERT INTO "posts" ("body", "created_at", "embed", "tags", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)