app/controllers/votes_controller.rb

INSERT INTO "votes" ("created_at", "direction", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 17 Apr 2013 09:17:20 UTC +00:00], ["direction", 1], ["post_id", 9], ["updated_at", Wed, 17 Apr 2013 09:17:20 UTC +00:00], ["user_id", nil]]
---
	def create
		Vote.create! params[:vote]